<!DOCTYPE html>
<html>
<head>
  <!--Metadatos identificador caracteres-->
  <meta charset="utf-8">
  <!--Metadatos idetificadores para busquedas-->
  <meta name="description" content="pilares de la web">
  <!--Metadatos Ubicuidad-->
  <meta name="viewport"content="width=device-width, initial-scale=1.0">
  <title>Los tres pilares de la Web</title>
  
<style>
h2 {
  text-align: center;
}
</style>
</head>

<body>
<h1 style= "color:rgb(73, 233, 24); text-decoration:none ; font-family:cursive";>Los tres pilares de la Web</h1>
<p>
  <a href="http://es.wikipedia.org/wiki/Tim_Berners-Lee" target="_blank" style="color:rgba(16, 182, 233, 0.959);text-decoration:none";>
    Tim Berners-Lee</a>
    es considerado el padre de la Web porque desarroll&oacute; los tres elementos b&aacute;sicos para el funcionamiento de la
    <a href="http://es.wikipedia.org/wiki/World_Wide_Web" target="_blank" style="color:rgba(16, 182, 233, 0.959);text-decoration:none";>Web</a>:
</p>

<ul>
  <li><a href="#html"style="color:rgba(16, 182, 233, 0.959);text-decoration:none";>HTML</a></li>
  <li><a href="#http"style="color:rgba(16, 182, 233, 0.959);text-decoration:none";>HTTP</a></li>
  <li><a href="#url"style="color:rgba(16, 182, 233, 0.959);text-decoration:none";>URL</a></li>
  <li><a href="#3W"style="color:rgba(16, 182, 233, 0.959);text-decoration:none";>3W</a></li>
  <li><a href="#Wsemantica"style="color:rgba(16, 182, 233, 0.959);text-decoration:none";>Web SEMANTICA</a></li>
</ul>

<h2 style= "color:rgb(73, 233, 24); text-decoration:none ; font-family:cursive" id="html";>HTML</h2>
<p>
  HTML, siglas de <strong>HyperText Markup Language</strong>,
  hace referencia al <span style="color:rgb(43, 255, 0)" >lenguaje</span>
 de marcado para la elaboraci&oacute;n de p&aacute;ginas web.
  Es un est&aacute;ndar que sirve de referencia para la elaboraci&oacute;n de p&aacute;ginas web
  en sus diferentes versiones, define una estructura ba&acute;sica y un co&acute;digo (denominado c&oacute;digo HTML)
  para la definici&oacute;n de contenido de una p&aacute;gina web, como texto, im&aacute;genes, entre otros.
  Es un est&aacute;ndar a cargo de la W3C, organizaci&oacute;n dedicada a la estandarizaci&oacute;n de casi todas
  las tecnologi&iacute;as ligadas a la web, sobre todo en lo referente a su escritura e interpretaci&oacute;n.
  Es el lenguaje con el que se definen las p&aacute;ginas web.
</p>

<p>
Fuente: <a href="http://es.wikipedia.org/wiki/HTML" target="_blank" style="color:rgba(16, 182, 233, 0.959); text-decoration:none";>HTML</a>, Wikipedia
</p>

<h2 style= "color:rgb(73, 233, 24); text-decoration:none ; font-family:cursive" id="http";>HTTP</h2>
<p>
  <strong>Hypertext Transfer Protocol</strong> o HTTP (en espa&ntilde;ol protocolo de transferencia de hipertexto)
  es el protocolo usado en cada transaccio&acute;n de la World Wide Web.
  HTTP fue desarrollado por el World Wide Web Consortium y la Internet Engineering Task Force,
  colaboraci&oacute;n que culmin&oacute; en 1999 con la publicaci&oacute;n de una serie de RFC,
  el m&aacute;s importante de ellos es el RFC 2616 que especifica la versi&oacute;n 1.1.
</p>

<p>
Fuente: <a href="http://es.wikipedia.org/wiki/Hypertext_Transfer_Protocol" target="_blank" style="color:rgba(16, 182, 233, 0.959); text-decoration:none";>HTTP</a>, Wikipedia
</p>

<h2 style= "color:rgb(73, 233, 24); text-decoration:none ; font-family:cursive" id="url";>URL</h2>
<p>
Un <strong>localizador de recursos uniforme</strong> o URL &ndash;siglas en ingl&eacute;s de <em>Uniform Resource Locator</em>&ndash;
es un identificador de recursos uniforme (URI) cuyos recursos referidos pueden cambiar, esto es, la direcci&oacute;n puede
apuntar a recursos variables en el tiempo. Est&aacute;n formados por una secuencia de caracteres, de acuerdo a un formato
 mod&eacute;lico y est&aacute;ndar, que designa recursos en una red, como Internet.
</p>

<p>
    Fuente: <a href="http://es.wikipedia.org/wiki/Localizador_de_recursos_uniforme" target="_blank" style="color:rgba(16, 182, 233, 0.959); text-decoration:none";>URL</a>, Wikipedia
</p>

<h2 style= "color:rgb(73, 233, 24); text-decoration:none ; font-family:cursive" id="3W";>World Wide Web</h2>
<p >
  En inform&aacute;tica, la World Wide Web (La Web) o red inform&aacute;tica mundial es un sistema que funciona a trav&eacute;s de Internet,
  por el cual se pueden transmitir diversos tipos de datos a trav&eacute;s del Protocolo de Transferencia de Hipertextos o HTTP, 
  que son los enlaces de la p&aacute;gina web.
</p>

<p>
    Fuente: <a href="https://es.wikipedia.org/wiki/World_Wide_Web" target="_blank" style="color:rgba(16, 182, 233, 0.959); text-decoration:none";>World Wide Web</a>, Wikipedia
</p>

<h2 style= "color:rgb(73, 233, 24); text-decoration:none ; font-family:cursive"; id="Wsemantica">Web Sem&aacute;ntica</h2>
<p>
  La web sem&aacute;ntica (del ingl&eacute;s semantic web) es un conjunto de actividades desarrolladas en el seno de 
  World Wide Web Consortium con tendencia a la creaci&oacute;n de tecnolog&iacute;as para publicar datos legibles por aplicaciones 
  inform&aacute;ticas (m&aacute;quinas en la terminolog&iacute;a de la Web sem&aacute;ntica). Se basa en la idea de a&ntilde;adir metadatos sem&aacute;nticos 
  y ontol&oacute;gicos a la World Wide Web. Esas informaciones adicionales &ndash;que describen el contenido, el significado y la 
  relaci&oacute;n de los datos&ndash; se deben proporcionar de manera formal, para que as&iacute; sea posible evaluarlas autom&aacute;ticamente 
  por m&aacute;quinas de procesamiento. El objetivo es mejorar Internet ampliando la interoperabilidad entre los sistemas 
  inform&aacute;ticos usando "agentes inteligentes". Agentes inteligentes son programas en las computadoras que buscan 
  informaci&oacute;n sin operadores humanos.
</p>

<p>
    Fuente: <a href="https://es.wikipedia.org/wiki/Web_sem%C3%A1ntica" target="_blank" style="color:rgba(16, 182, 233, 0.959); text-decoration:none";>WEB SEMANTICA</a>, Wikipedia
</p>
<address>
  Escrito por <a href="mailto:webmaster@example.com" style="color:rgba(16, 182, 233, 0.959);text-decoration:none";>Juan Pe&acute;rez</a>.<br>
  Visitanos en:<br>
  www.itorizaba.edu.com<br>
  CP 94340, Col. Zapata<br>
  Orizaba, Veracruz, M&eacute;xico.
</address>

</body>
</html>
